pmo-dataset/graphviz/28.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Internship process\nis started" -> "Register for\ninternship";
  "InclusiveGateway_1" -> "Enter hobbies";
  "Enter hobbies" -> "InclusiveGateway_2";
  "Recieve offer" -> "Accept offer?";
  "ExclusiveGateway_1" -> "Recieve offer";
  "Deny offer" -> "ExclusiveGateway_1";
  "Publish your\napplication" -> "ExclusiveGateway_1";
  "ParallelGateway_2" -> "Accept offer";
  "ParallelGateway_2" -> "Invalidate all other\noffers";
  "Accept offer" -> "ParallelGateway_1";
  "Invalidate all other\noffers" -> "ParallelGateway_1";
  "Begin internship" -> "ParallelGateway_3";
  "InclusiveGateway_1" -> "Enter experience";
  "InclusiveGateway_1" -> "Enter expected\nincome";
  "Enter experience" -> "InclusiveGateway_2";
  "Enter expected\nincome" -> "InclusiveGateway_2";
  "ParallelGateway_3" -> "Write at least 3\nstatus updates every\nweek";
  "ParallelGateway_3" -> "Recieve 3 status\nupdates from the\ncompany";
  "Recieve 3 status\nupdates from the\ncompany" -> "ParallelGateway_4";
  "Write at least 3\nstatus updates every\nweek" -> "ParallelGateway_4";
  "Recommend company?" -> "Recommend company to\na list of friends\nvia twitter api" [label="Yes"];
  "ParallelGateway_1" -> "Begin internship";
  "End internship" -> "Recommend company?";
  "Register for\ninternship" -> "ParallelGateway_5";
  "ParallelGateway_4" -> "End internship";
  "ParallelGateway_5" -> "Enter topic";
  "InclusiveGateway_2" -> "ParallelGateway_6";
  "Enter topic" -> "ParallelGateway_6";
  "ParallelGateway_5" -> "InclusiveGateway_1";
  "ParallelGateway_6" -> "Publish your\napplication";
  "Accept offer?" -> "Deny offer" [label="No"];
  "Accept offer?" -> "ParallelGateway_2" [label="Yes"];
  "Recommend company?" -> "ExclusiveGateway_2" [label="No"];
  "ExclusiveGateway_2" -> "Internship succesful";
  "Recommend company to\na list of friends\nvia twitter api" -> "ExclusiveGateway_2";

  "Internship process\nis started" [shape=circle];
  "Internship succesful" [shape=circle, penwidth=4];
  "Accept offer?" [shape=diamond];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "Recommend company?" [shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
  "ParallelGateway_3" [label="+", shape=diamond];
  "ParallelGateway_4" [label="+", shape=diamond];
  "ParallelGateway_5" [label="+", shape=diamond];
  "ParallelGateway_6" [label="+", shape=diamond];
  "InclusiveGateway_1" [label="O", shape=diamond];
  "InclusiveGateway_2" [label="O", shape=diamond];
}
