pmo-dataset/variations/mermaid_with_ids/28.mmd
graph LR
	classDef endEvent stroke-width:3px
	User_1["Register for\ninternship"]
	User_2["Enter topic"]
	User_3["Enter expected\nincome"]
	User_4["Enter experience"]
	User_5["Enter hobbies"]
	User_6["Accept offer"]
	User_7["Deny offer"]
	User_8["Publish your\napplication"]
	User_9["Begin internship"]
	User_10["Write at least 3\nstatus updates every\nweek"]
	User_11["End internship"]
	Service_1["Recieve offer"]
	Service_2["Invalidate all other\noffers"]
	Service_3["Recommend company to\na list of friends\nvia twitter api"]
	Service_4["Recieve 3 status\nupdates from the\ncompany"]
	StartNoneEvent_1(("Internship process\nis started"))
	EndNoneEvent_1(("Internship succesful")):::endEvent
	ExclusiveGateway_1{"Accept offer?"}
	ExclusiveGateway_2{"X"}
	ExclusiveGateway_3{"Recommend company?"}
	ExclusiveGateway_4{"X"}
	ParallelGateway_1{"+"}
	ParallelGateway_2{"+"}
	ParallelGateway_3{"+"}
	ParallelGateway_4{"+"}
	ParallelGateway_5{"+"}
	ParallelGateway_6{"+"}
	InclusiveGateway_1{"O"}
	InclusiveGateway_2{"O"}

	StartNoneEvent_1 --> User_1
	InclusiveGateway_1 --> User_5
	User_5 --> InclusiveGateway_2
	Service_1 --> ExclusiveGateway_1
	ExclusiveGateway_2 --> Service_1
	User_7 --> ExclusiveGateway_2
	User_8 --> ExclusiveGateway_2
	ParallelGateway_2 --> User_6
	ParallelGateway_2 --> Service_2
	User_6 --> ParallelGateway_1
	Service_2 --> ParallelGateway_1
	User_9 --> ParallelGateway_3
	InclusiveGateway_1 --> User_4
	InclusiveGateway_1 --> User_3
	User_4 --> InclusiveGateway_2
	User_3 --> InclusiveGateway_2
	ParallelGateway_3 --> User_10
	ParallelGateway_3 --> Service_4
	Service_4 --> ParallelGateway_4
	User_10 --> ParallelGateway_4
	ExclusiveGateway_3 -->|"Yes"| Service_3
	ParallelGateway_1 --> User_9
	User_11 --> ExclusiveGateway_3
	User_1 --> ParallelGateway_5
	ParallelGateway_4 --> User_11
	ParallelGateway_5 --> User_2
	InclusiveGateway_2 --> ParallelGateway_6
	User_2 --> ParallelGateway_6
	ParallelGateway_5 --> InclusiveGateway_1
	ParallelGateway_6 --> User_8
	ExclusiveGateway_1 -->|"No"| User_7
	ExclusiveGateway_1 -->|"Yes"| ParallelGateway_2
	ExclusiveGateway_3 -->|"No"| ExclusiveGateway_4
	ExclusiveGateway_4 --> EndNoneEvent_1
	Service_3 --> ExclusiveGateway_4
